# RebarStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..RebarStyle Property
RebarShape Class See Also
---
Whether the shape represents a standard bar or a stirrup.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public RebarStyle RebarStyle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RebarStyle As RebarStyle
	Get
```

Visual C++
---
```text
public:
property RebarStyle RebarStyle {
	RebarStyle get ();
}
```

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace